app/controllers/infos_controller.rb

  def index
    @infos = Info.all
---
SELECT "infos".* FROM "infos"

  def create
    @info = Info.new(info_params)

    respond_to do |format|
      if @info.save
---
INSERT INTO "infos" ("pelicula", "director", "genero", "usuario", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def destroy
    @info.destroy
---
DELETE FROM "infos" WHERE "infos"."id" = ?  [["id", 4]]

    def set_info
      @info = Info.find(params[:id])
---
SELECT  "infos".* FROM "infos" WHERE "infos"."id" = ? LIMIT 1  [["id", 4]]